app/Controllers/Main.php

SELECT *
FROM `mt_komponent`
INNER JOIN `mt_typkomponent` ON `mt_komponent`.`typKomponentid` = `mt_typkomponent`.`idKomponent`
WHERE `url` = 'cooler'
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `mt_komponent`
INNER JOIN `mt_typkomponent` ON `mt_komponent`.`typKomponentid` = `mt_typkomponent`.`idKomponent`
WHERE `url` = 'cooler'
---
    public function getKomponent($url)
    {
        $oof =  $this->config->itemsForPage;
        $data["com"] = $this->com->join('typkomponent', 'komponent.typKomponentid = typkomponent.idKomponent',"inner");
        $data["com"] = $this->com->where('url',$url)->paginate($oof);

SELECT *
FROM `mt_komponent`
INNER JOIN `mt_vyrobce` ON `mt_komponent`.`vyrobce_id` = `mt_vyrobce`.`idVyrobce`
INNER JOIN `mt_parametr` ON `mt_komponent`.`id` = `mt_parametr`.`komponent_id`
INNER JOIN `mt_nazevparametr` ON `mt_nazevparametr`.`id` = `mt_parametr`.`nazevParametr_id`
WHERE `mt_komponent`.`id` = '1'
SELECT *
FROM `mt_parametr`
INNER JOIN `mt_nazevparametr` ON `mt_nazevparametr`.`id` = `mt_parametr`.`nazevParametr_id`
WHERE `komponent_id` = '1'
---
    public function getInfo($id)
    {
        $data["com"] = $this->com->join('vyrobce', 'komponent.vyrobce_id = vyrobce.idVyrobce',"inner")->join('parametr', 'komponent.id = parametr.komponent_id',"inner")->join('nazevparametr', 'nazevparametr.id = parametr.nazevParametr_id',"inner")->find($id);
        $data["parametr"] = $this->parametr->join('nazevparametr', 'nazevparametr.id = parametr.nazevParametr_id',"inner")->where("komponent_id", $id)->findall();